#include <stdio.h>

struct employee {
    int number;
    char name[20];
    int age;
    char tel[20];
};

//나이가 20이상 30이하인 직원 찾기
int main(void) {
    struct employee em[10] = {
      { 1, "홍길동", 20, "111-1111" },
      { 2, "강감찬", 25, "111-1112" },
      { 3, "이기동", 60, "111-1113" },
      { 4, "권김율", 40, "111-1114" },
      { 5, "아리랑", 50, "111-1115" },
      { 6, "사나이", 45, "111-1116" },
      { 7, "이리안", 32, "111-1117" },
      { 8, "아리아", 23, "111-1118" },
      { 9, "홍길순", 29, "111-1119" },
      { 10, "감놔라", 62, "111-1120" } 
	};
    
  for(int i=0; i<10; i++) {
    if(em[i].age >= 20 && em[i].age <= 30) 
      printf("%s\n", em[i].name);
	}
}
